In [1]:
import numpy as np
import pandas as pd

In [2]:
dataset = pd.read_csv('SUV_Purchase.csv')

In [3]:
dataset.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [4]:
dataset.shape

(400, 5)

In [5]:
dataset.drop(['User ID'], axis=1, inplace=True)

In [6]:
dataset.head()

   Gender  Age  EstimatedSalary  Purchased
0    Male   19            19000          0
1    Male   35            20000          0
2  Female   26            43000          0
3  Female   27            57000          0
4    Male   19            76000          0

In [7]:
dataset.isnull().sum()

Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [8]:
dataset.describe()

              Age  EstimatedSalary   Purchased
count  400.000000       400.000000  400.000000
mean    37.655000     69742.500000    0.357500
std     10.482877     34096.960282    0.479864
min     18.000000     15000.000000    0.000000
25%     29.750000     43000.000000    0.000000
50%     37.000000     70000.000000    0.000000
75%     46.000000     88000.000000    1.000000
max     60.000000    150000.000000    1.000000

In [9]:
print(dataset['Gender'].unique())

['Male' 'Female']

In [10]:
dataset = pd.get_dummies(dataset, drop_first=True)

In [11]:
dataset.head()

   Age  EstimatedSalary  Purchased  Gender_Male
0   19            19000          0            1
1   35            20000          0            1
2   26            43000          0            0
3   27            57000          0            0
4   19            76000          0            1

In [12]:
X = dataset[['Age', 'EstimatedSalary', 'Gender_Male']]
y = dataset.iloc[:,2]

In [13]:
X.head()

   Age  EstimatedSalary  Gender_Male
0   19            19000            1
1   35            20000            1
2   26            43000            0
3   27            57000            0
4   19            76000            1

In [14]:
y.head()

0    0
1    0
2    0
3    0
4    0
Name: Purchased, dtype: int64

In [15]:
from sklearn.model_selection import train_test_split  
X_train, X_test, y_train, y_test= train_test_split(X, y, test_size= 0.25, random_state=0)

In [16]:
from sklearn.preprocessing import StandardScaler    
st_x= StandardScaler()  
X_train= st_x.fit_transform(X_train)    
X_test= st_x.transform(X_test)

In [17]:
from sklearn.tree import DecisionTreeClassifier  
classifiers= DecisionTreeClassifier(criterion='entropy', random_state=0, max_depth=5)  
classifiers.fit(X_train, y_train)

DecisionTreeClassifier(criterion='entropy', max_depth=5, random_state=0)

In [18]:
y_pred= classifiers.predict(X_test)

In [19]:
from sklearn.metrics import confusion_matrix  
cm= confusion_matrix(y_test, y_pred) 
print(cm)

[[65  3]
 [ 3 29]]

In [21]:
from sklearn.tree import DecisionTreeClassifier  
classifier= DecisionTreeClassifier(criterion='entropy', random_state=0, max_depth=5)  
classifier.fit(X_train, y_train) 
prediction = classifier.predict(X_test)

In [22]:
import pickle
file = open('decison_tree_classifier.pkl', 'wb')
pickle.dump(classifier, file)